tutorials/reactingLagrangianQGDFoam/counterFlame2D/0/constr.include
    frontAndBack
    {
        type        empty;
    }
